In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series(["Abhay","Krishna","Minachi"])
s1

0      Abhay
1    Krishna
2    Minachi
dtype: object

In [4]:
list = [1,6,8,4,3]
s1 = pd.Series(list)
s1

0    1
1    6
2    8
3    4
4    3
dtype: int64

In [5]:
s2 = pd.Series(["Hubli","chennai","Hydrabad","Kochi"],index=["KA","TN","TS","KL"])
s2

KA       Hubli
TN     chennai
TS    Hydrabad
KL       Kochi
dtype: object

In [6]:
s2[["TS","KL",'KA']]

TS    Hydrabad
KL       Kochi
KA       Hubli
dtype: object

In [7]:
x = (np.linspace(0,20,5))
x
s1 = pd.Series(x)
s1

0     0.0
1     5.0
2    10.0
3    15.0
4    20.0
dtype: float64

In [8]:
x = np.array(['a','b','c','d','e'])
x

array(['a', 'b', 'c', 'd', 'e'], dtype='<U1')

In [28]:
dict1 = {'India':'Bombay','China':'Bijing','UK':'London','USA':'Washington',
         'Canada':'Utah','Africa':'Capetwon','France':'Prais'}

In [29]:
s1 = pd.Series(dict1)
s1["China"]

'Bijing'

In [12]:
s1[1]

'Bijing'

In [13]:
s1[[2,3]]

UK         London
USA    Washington
dtype: object

In [15]:
s1[['India','China']]

India    Bombay
China    Bijing
dtype: object

In [21]:
s1.index = [10,20,30,99]
s1

10        Bombay
20        Bijing
30        London
99    Washington
dtype: object

In [32]:
s1[2:]

UK            London
USA       Washington
Canada          Utah
Africa      Capetwon
France         Prais
dtype: object

In [34]:
s1[::-1]

France         Prais
Africa      Capetwon
Canada          Utah
USA       Washington
UK            London
China         Bijing
India         Bombay
dtype: object

In [37]:
s2 = pd.Series(np.arange(10,16,1))
s2

0    10
1    11
2    12
3    13
4    14
5    15
dtype: int32

In [38]:
s2[2:4] = 56
s2

0    10
1    11
2    56
3    56
4    14
5    15
dtype: int32

In [40]:
s2[3] = 500
s2

0     10
1     11
2     56
3    500
4     14
5     15
dtype: int32

In [50]:
s1.name = 'Capitals'
s1.index.name = 'Country'
s1

Country
India         Bombay
China         Bijing
UK            London
USA       Washington
Canada          Utah
Africa      Capetwon
France         Prais
Name: Capitals, dtype: object

In [51]:
s1.values

array(['Bombay', 'Bijing', 'London', 'Washington', 'Utah', 'Capetwon',
       'Prais'], dtype=object)

In [56]:
ser1 = pd.Series(np.arange(10,16,1))
ser1.index.name = 'Sr No'
ser1

Sr No
0    10
1    11
2    12
3    13
4    14
5    15
dtype: int32

In [59]:
ser1.count()

6

In [60]:
seriesA = pd.Series([1,2,3,4,5], index =
['a', 'b', 'c', 'd', 'e'])
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [62]:
seriesB = pd.Series([10,20,-10,-50,100],
index = ['z', 'y', 'a', 'c', 'e'])
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [63]:
seriesA+seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [65]:
seriesA.add(seriesB,fill_value=100)

a     -9.0
b    102.0
c    -47.0
d    104.0
e    105.0
y    120.0
z    110.0
dtype: float64

In [66]:
seriesA.subtract(seriesB,fill_value=100)

a    11.0
b   -98.0
c    53.0
d   -96.0
e   -95.0
y    80.0
z    90.0
dtype: float64

In [68]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [78]:
array1 = np.array([100,200,300,400])
array2 = np.array(['abhay','minachi','data','krishna'])
array3 = np.array([12,45,65,98])
array4 = np.array([23.4,12.45,65.45,98.9])
df = pd.DataFrame([array1,array2,array3,array4],columns=['one','two','three','four'])
df

     one      two  three     four
0    100      200    300      400
1  abhay  minachi   data  krishna
2     12       45     65       98
3   23.4    12.45  65.45     98.9

In [80]:
listDict = [{'a':10, 'b':20}, {'a':5,
'b':10, 'c':20}]
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [86]:
forest = {'Location':['Karnataka','tamilnadu','Assam','Keral'],'Area':[45,65.8,78.45,12.2],'Animals':['Tiger','Leopard','Snake','Crocodile']}
dF = pd.DataFrame(forest)
dF

    Location   Area    Animals
0  Karnataka  45.00      Tiger
1  tamilnadu  65.80    Leopard
2      Assam  78.45      Snake
3      Keral  12.20  Crocodile

In [87]:
ResultSheet={
'Arnab': pd.Series([90, 91, 97],
index=['Maths','Science','Hindi']),
'Ramit': pd.Series([92, 81, 96],
index=['Maths','Science','Hindi']),
'Samridhi': pd.Series([89, 91, 88],
index=['Maths','Science','Hindi']),
'Riya': pd.Series([81, 71, 67],
index=['Maths','Science','Hindi']),
'Mallika': pd.Series([94, 95, 99],
index=['Maths','Science','Hindi'])}

In [118]:
Result = pd.DataFrame(ResultSheet)
Result

         Arnab  Ramit  Samridhi  Riya  Mallika
Maths       90     92        89    81       94
Science     91     81        91    71       95
Hindi       97     96        88    67       99

In [91]:
dictForUnion = { 'Series1' : pd.Series([1,2,3,4,5], index = ['a', 'b', 'c', 'd', 'e']) ,
'Series2' : pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e']),
'Series3' : pd.Series([10,20,-10,-50,100], index = ['z', 'y', 'a', 'c', 'e']) }

In [93]:
df = pd.DataFrame(dictForUnion)
df

   Series1  Series2  Series3
a      1.0    -10.0    -10.0
b      2.0      NaN      NaN
c      3.0    -50.0    -50.0
d      4.0      NaN      NaN
e      5.0    100.0    100.0
y      NaN     20.0     20.0
z      NaN     10.0     10.0

In [121]:
Result["Preeti"] = [45,65,87]
Result

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87

In [98]:
Result["Ramit"] = [12,0,0]
Result

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     12        89    81       94      45
Science     91      0        91    71       95      65
Hindi       97      0        88    67       99      87

In [99]:
Result["Riya"] = 100
Result

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     12        89   100       94      45
Science     91      0        91   100       95      65
Hindi       97      0        88   100       99      87

In [122]:
Result.loc["Kannada"] = [45,87,96,65,75,35]
Result

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87
Kannada     45     87        96    65       75      35

In [103]:
Result.loc["Science"] = [85,42,65,20,65,36]
Result

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     12        89   100       94      45
Science     85     42        65    20       65      36
Hindi       97      0        88   100       99      87
Kannada     45     87        96    65       75      35

In [104]:
Result.dtypes

Arnab       int64
Ramit       int64
Samridhi    int64
Riya        int64
Mallika     int64
Preeti      int64
dtype: object

In [110]:
Result.shape

(4, 6)

In [114]:
Result = Result.drop('Ramit',axis=1)

In [116]:
Result = Result.drop('Science',axis=0)

In [117]:
Result

         Arnab  Samridhi  Riya  Mallika  Preeti
Maths       90        89   100       94      45
Hindi       97        88   100       99      87
Kannada     45        96    65       75      35

In [123]:
Result

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87
Kannada     45     87        96    65       75      35

In [126]:
Result.drop(['Ramit','Samridhi','Mallika'],axis=1)

         Arnab  Riya  Preeti
Maths       90    81      45
Science     91    71      65
Hindi       97    67      87
Kannada     45    65      35

In [129]:
Result.rename({"Kannada":"Marathi"},axis='index')

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87
Marathi     45     87        96    65       75      35

In [130]:
Result.rename({'Hindi':"English"},axis='index')

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
English     97     96        88    67       99      87
Kannada     45     87        96    65       75      35

In [133]:
Result.rename({'Matssds':"English"},axis='index')

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87
Kannada     45     87        96    65       75      35

In [135]:
Result.rename({'Arnab':"Student1"},axis='columns')

         Student1  Ramit  Samridhi  Riya  Mallika  Preeti
Maths          90     92        89    81       94      45
Science        91     81        91    71       95      65
Hindi          97     96        88    67       99      87
Kannada        45     87        96    65       75      35

In [142]:
Result.loc[["Maths"]]

       Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths     90     92        89    81       94      45

In [147]:
Result.iloc[1]

Arnab       91
Ramit       81
Samridhi    91
Riya        71
Mallika     95
Preeti      65
Name: Science, dtype: int64

In [161]:
Result.loc[['Science','Hindi','Maths']]

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87
Maths       90     92        89    81       94      45

In [164]:
Result.loc[['Maths','Hindi'],['Ramit','Riya']]

       Ramit  Riya
Maths     92    81
Hindi     96    67

In [165]:
Result[["Ramit","Riya"]]

         Ramit  Riya
Maths       92    81
Science     81    71
Hindi       96    67
Kannada     87    65

In [166]:
Result[:]

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87
Kannada     45     87        96    65       75      35

In [180]:
Result["Arnab"] > 90

Maths      False
Science     True
Hindi       True
Kannada    False
Name: Arnab, dtype: bool

In [188]:
Result[(Result["Arnab"] > 90) & (Result["Riya"]>60)]

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87

In [192]:
Result[Result["Arnab"] > 90]

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Science     91     81        91    71       95      65
Hindi       97     96        88    67       99      87

In [195]:
Result.loc[['Science','Maths'],['Arnab','Riya']]

         Arnab  Riya
Science     91    71
Maths       90    81

In [198]:
Result.loc[[True, False, True,True]]

         Arnab  Ramit  Samridhi  Riya  Mallika  Preeti
Maths       90     92        89    81       94      45
Hindi       97     96        88    67       99      87
Kannada     45     87        96    65       75      35

In [209]:
dFrame1=pd.DataFrame([[1, 2, 3], [4, 5],[6]], columns=['C1', 'C2', 'C3'], index=['R1','R2','R3'])
dFrame1

    C1   C2   C3
R1   1  2.0  3.0
R2   4  5.0  NaN
R3   6  NaN  NaN

In [204]:
dFrame2=pd.DataFrame([[10, 20], [30], [40,50]], columns=['C2', 'C5'], index=['R4', 'R2','R5'])
dFrame2

    C2    C5
R4  10  20.0
R2  30   NaN
R5  40  50.0

In [211]:
dFrame1 = dFrame1.append(dFrame2)

C:\Users\Abhay Minachi\AppData\Local\Temp\ipykernel_8104\47984581.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dFrame1 = dFrame1.append(dFrame2)

In [214]:
dFrame1.sort_index()

     C1    C2   C3    C5
R1  1.0   2.0  3.0   NaN
R2  4.0   5.0  NaN   NaN
R2  NaN  30.0  NaN   NaN
R3  6.0   NaN  NaN   NaN
R4  NaN  10.0  NaN  20.0
R5  NaN  40.0  NaN  50.0

In [215]:
Result.index

Index(['Maths', 'Science', 'Hindi', 'Kannada'], dtype='object')

In [216]:
Result.columns

Index(['Arnab', 'Ramit', 'Samridhi', 'Riya', 'Mallika', 'Preeti'], dtype='object')

In [217]:
Result.dtypes

Arnab       int64
Ramit       int64
Samridhi    int64
Riya        int64
Mallika     int64
Preeti      int64
dtype: object

In [219]:
Result.T

          Maths  Science  Hindi  Kannada
Arnab        90       91     97       45
Ramit        92       81     96       87
Samridhi     89       91     88       96
Riya         81       71     67       65
Mallika      94       95     99       75
Preeti       45       65     87       35